export default function renderNumberPiramyd (rows) {
    let num = 1; // початкове значення num

    for (let i = 1; i <= rows; i++) { // проганяємо 6 разів
        let str = ''; // при кожній ітерації створюємо новий рядок (нам треба 6 рядків)

        // проганяємо стільки разів, на якому кроці ми зараз в зовнішньому циклі. Бо стільки цифер нам треба буде з'єднати
        for (let j = 1; j <= i; j++) {
            num = (num === 10) ? 0 : num; // обнуляємо num, якщо він 10
            str += num; // записуємо в строку num, об'єднавши з попереднім значенням
            num++; // збільшуємо num на 1
        }
        console.log(str); // на кожній ітерації зовнішнього циклу виводимо створений у внутрішньому циклі рядок
    }
}
