const asterisk = '*'; // 1 запис зірочки
const plus = '+'; // 1 запис плюсика

let star = ''; // створюємо пусту строку зірочок
let cross = ''; // створюємо пусту строку плюсиків

for (let i = 1; i <= 6; i++) { // проганяємо 6 разів
    star += asterisk; // при кожній ітерації дописуємо в існуючу строку зірочок ще 1 запис
    cross += plus; // при кожній ітерації дописуємо в існуючу строку плюсиків ще 1 запис

    if (i % 2 !== 0) { // якщо ітерація непарна
        console.log(cross); // виводимо рядок з плюсиками
        continue; // виходимо з цієї ітерації
    }
    console.log(star); // якщо парна, то виводимо рядок з зірочками
}
