export default function random(from, to) {
    if (typeof from === 'number' && typeof to === 'number') {
        if (to <= from) {
            return 'your "from" should be mare than "to"';
        }
        return Math.floor(Math.random() * (to - from + 1)) + from;
    }
    return 'you should enter only two numbers';
}

// 1) Math.random(): Це вбудований метод JavaScript, який генерує псевдовипадкове число з рухомою комою в діапазоні від 0 (включно) до 1 (не включно). Іншими словами, він генерує число від 0 до менше, ніж 1.
// 2) (to - from + 1): Цей вираз обчислює розмір діапазону, в якому має бути згенероване випадкове число. Наприклад, якщо from дорівнює 2, а to дорівнює 5, то розмір діапазону буде 5 - 2 + 1 = 4.
// 3) Math.random() * (to - from + 1): Це множить випадкове число (яке знаходиться в діапазоні від 0 до 1) на розмір діапазону. Таким чином, результатом цього виразу буде псевдовипадкове число в діапазоні від 0 до розміру діапазону.
// 4) Math.floor(...): Це округлює результат виразу Math.random() * (to - from + 1) в меншу сторону, щоб отримати ціле число. Це необхідно, оскільки результат виразу може бути десятковим числом, але ми хочемо отримати ціле число.
// 5) + from: Це зсуває результат на значення from. Після того, як випадкове число було згенероване і округлене до цілого, ми додаємо значення from, щоб зсунути результат так, щоб він знаходився в зазначеному діапазоні від from до to.