let a = 3
fn3() // виклик задекларованої нижче ф-ції. в ній b глобално 22, а змінилось зверху, тому - !вивід 7: 22 + 3 = 25
let b = 11

const fn1 = () => {
    let b = 25 // оголошує нову b для ф-ції fn1
    a = 2 // перезаписує a (всередині ф-ції fn1, або після виклику ф-ції)

    const fn2 = () => {
        a += 5 // 7 (всередині ф-ції fn2, або після виклику ф-ції)
        console.log('1', a + b) // вивід 1 потенційно: 7 + 25 = 32
    }

    console.log('2', a + b) //  вивід !2: 2 + 25 = 27, fn2 ще не виконалась, тому а=2,
    b = 44  // перезаписує  b  (всередині ф-ції fn1)
    return fn2 // після зміни b новий вивід 1 потенційно: 7 + 44 = 51, але повернеться просто код функції
}

a = 5 // перезаписали а глобально, на а, яке оголошене чи змінени всередині попередніх ф-кцій це не повпливає
const callback = fn1() // сюди скопіювали то шо повернеться в fn1, тобто код функції fn2
console.log('3', a + b) // !вивід 3: 2 + 11 = 13 (b яке спочатку, бо в функції воно локально оголошується і перезаписується лише в ній, а - яке в ф-ції fn1 - вона вже виконалась коли записувалась в колбек, виконалась без fn2, там тільки код повернувся )
a = 33 // перезаписали а глобально
b = 22 // перезаписали b глобально
callback() // виконався код ф-ції fn2 і все в fn1, а = 33+5 = 38, b = 44 всередині ф-ції fn1  !вивід 1: 38 + 44 = 82
console.log('4', a + b) // а змінилось в попередній ф-ції на 38, b глобално лишилось 22, !вивід 4: 60
callback() // виконався код ф-ції fn2 і все в fn1, а змінилось в попередній ф-ції на 38, а = 38+5 = 43, b = 44 всередині ф-ції fn1  !вивід 1: 43 + 44 = 87
console.log('5', a + b) // а змінилось в попередній ф-ції на 43, b глобално лишилось 22, !вивід 5: 65
callback() // виконався код ф-ції fn2 і все в fn1, а змінилось в попередній ф-ції на 43, а = 43+5 = 48, b = 44 всередині ф-ції fn1  !вивід 1: 48 + 44 = 92
console.log('6', a + b) // а змінилось в попередній ф-ції на 48, b глобално лишилось 22, !вивід 6: 70
function fn3() {
    console.log('7', a + b) // а змінилось в попередній ф-ції на 48, b глобално лишилось 22, вивід 7 потенційно: 70
}
